app/controllers/accounting/purchase_balances_controller.rb

  def index
    @credit = AccountingPurchaseDebitCredit.count(:all, :conditions => ["credit IS true"], :group => "account_id").length
    @debit = AccountingPurchaseDebitCredit.count(:all, :conditions => ["debit IS true"], :group => "account_id").length
    get_total_field
    if request.post? && params[:date]
      $month, $year = params[:date][:month], params[:date][:year]
    elsif request.get? && $selected_month && $selected_year
      $month, $year = $selected_month, $selected_year
      $selected_month, $selected_year = nil, nil
    elsif request.get? && params[:format].nil? && $selected_month.nil? && $selected_year.nil?
      $month, $year = current_month, current_year
    end

    @can_input = true
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('purchase').nil?
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('cash').nil?
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('payable').nil?
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('discount').nil?
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('shipping_debit').nil?
    @can_input = false if AccountingPurchaseDebitCredit.find_by_account_type('shipping_credit').nil?

    conditions = []
    conditions << "MONTH(invoice_date) = #{$month}"
    conditions << "YEAR(invoice_date) = #{$year}"
    conditions = conditions.join(" AND ")

    @purchase_balances = AccountingPurchaseBalance.paginate :page => params[:page], :conditions => conditions, :order => 'invoice_date desc'
---
SELECT * FROM `accounting_purchase_debit_credits` WHERE (accounting_purchase_debit_credits.credit=1) ORDER BY account_id
SELECT count(*) AS count_all, account_id AS account_id FROM `accounting_purchase_debit_credits` WHERE (credit IS true) GROUP BY account_id
SELECT * FROM `accounting_purchase_debit_credits` WHERE (`accounting_purchase_debit_credits`.`account_type` = 'purchase') LIMIT 1
SELECT * FROM `accounting_purchase_balances` WHERE (MONTH(invoice_date) = 12 AND YEAR(invoice_date) = 2011) ORDER BY invoice_date desc LIMIT 0, 10

  def payment_record
    render :update do |page|
      if params[:show]
        page.replace_html "payment-record-#{params[:id]}", :partial => "payment_record", :locals => {:purchase => AccountingPurchaseBalance.find(params[:id]) }
---
SELECT * FROM `accounting_purchase_balances` WHERE (`accounting_purchase_balances`.`id` = 2)