app/controllers/accounting/sale_balances_controller.rb

SELECT * FROM `accounting_sale_debit_credits` WHERE (account_type = 'cash' OR account_type = 'Bank' AND debit = '1')
SELECT count(*) AS count_all FROM `accounting_sale_debit_credits` WHERE (credit IS true)
SELECT * FROM `accounting_sale_signatures`
SELECT * FROM `accounting_sale_debit_credits` WHERE (`accounting_sale_debit_credits`.`account_type` = 'cash') LIMIT 1
SELECT * FROM `accounting_sale_balances` WHERE (MONTH(invoice_date)=03 AND YEAR(invoice_date)=2012) ORDER BY invoice_date DESC, id DESC LIMIT 0, 10
---
  def index
    @credit = AccountingSaleDebitCredit.count(:all, :conditions => ["credit IS true"])
    @debit = AccountingSaleDebitCredit.count(:all, :conditions => ["debit IS true"])
    get_total_field
    if request.post? && params[:date]
      $month, $year = params[:date][:month], params[:date][:year]
    elsif request.get? && $selected_month && $selected_year
      $month, $year = $selected_month, $selected_year
      $selected_month, $selected_year = nil, nil
    elsif request.get? && params[:format].nil? && $selected_month.nil? && $selected_year.nil?
      $month, $year = current_month, current_year
    end

    @can_input = true
    @can_input = false if AccountingSaleSignature.all.empty?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('cash').nil?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('receivable').nil?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('sale').nil?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('shipping').nil?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('shipping_contra').nil?
    @can_input = false if AccountingSaleDebitCredit.find_by_account_type('discount').nil?

    conditions = []
    conditions << "MONTH(invoice_date)=#{$month}"
    conditions << "YEAR(invoice_date)=#{$year}"
    conditions = conditions.join(" AND ")

    @sale_balances = AccountingSaleBalance.paginate :page => params[:page], :conditions => conditions, :order => 'invoice_date DESC, id DESC'

SELECT * FROM `accounting_taxes` WHERE (`accounting_taxes`.`account_type` = 'ppn_keluaran') LIMIT 1
---
  def new
    @index = -1
    @index_service = -1
    @sale_balance = AccountingSaleBalance.new
    ppn_keluaran = AccountingTax.find_by_account_type('ppn_keluaran')

SELECT * FROM `accounting_sale_balances` WHERE (`accounting_sale_balances`.`id` = 10)
SELECT * FROM `accounting_sale_balance_details` WHERE (`accounting_sale_balance_details`.sale_balance_id = 10)
SELECT count(*) AS count_all FROM `accounting_sale_balance_details` WHERE (`accounting_sale_balance_details`.sale_balance_id = 10)
SELECT * FROM `accounting_taxes` WHERE (`accounting_taxes`.`account_type` = 'ppn_keluaran') LIMIT 1
---
  def edit
    @sale_balance = AccountingSaleBalance.find(params[:id])
    @index = @sale_balance.accounting_sale_balance_details.size
    @index_service = @sale_balance.service_details.size
    ppn_keluaran = AccountingTax.find_by_account_type('ppn_keluaran')

INSERT INTO `accounting_sale_balances` (`shipping_cost`, `kurs`, `signature_id`, `job_id`, `subtotal`, `updated_at`, `evidence`, `shipping_date`, `total_discount`, `contra_account_id`, `taxable`, `sale_debit_credit_id`, `terms_of_payment_id`, `ppn_value`, `job_description`, `account_id`, `customer_id`, `price`, `sent`, `invoice_number`, `invoice_date`, `maturity_date`, `payment_value`, `qty`, `disc_percentage`, `po_num`, `total_subtotal`, `amount_account_payable`, `tax_reference`, `status_id`, `currency_id`, `paid`, `description`, `discount`, `transaction_value`, `created_at`, `travel_pass`) VALUES(0.0, 0.0, 1, '123', 4000.0, '2012-03-29 03:41:10', NULL, '2012-03-29 00:00:00', 0.0, NULL, 0, NULL, NULL, 0.0, '', NULL, 5, NULL, 1, '123', '2012-03-29 00:00:00', '2012-03-29 00:00:00', 0.0, NULL, 0.0, '123', 0.0, 4000.0, '123', NULL, 1, 0.0, NULL, 0.0, 4000.0, '2012-03-29 00:00:00', '123')
INSERT INTO `accounting_sale_balance_details` (`updated_at`, `subtotal`, `product_name`, `sale_balance_id`, `price`, `item_id`, `qty`, `position`, `discount`, `created_at`, `description`) VALUES('2012-03-29 03:41:10', 4000.0, 'Barang 2', 4, 2000.0, 2, 2.0, NULL, NULL, '2012-03-29 03:41:10', NULL)
---
  def create
    maturity_date = params[:sale_balance_maturity_date].split("-")
    params[:sale_balance]["maturity_date(1i)"] = maturity_date[2]
    params[:sale_balance]["maturity_date(2i)"] = maturity_date[1]
    params[:sale_balance]["maturity_date(3i)"] = maturity_date[0]
    invoice_date = params[:sale_balance_invoice_date].split("-")
    params[:sale_balance]["invoice_date(1i)"] = invoice_date[2]
    params[:sale_balance]["invoice_date(2i)"] = invoice_date[1]
    params[:sale_balance]["invoice_date(3i)"] = invoice_date[0]

    @sale_balance = AccountingSaleBalance.new(params[:sale_balance])
    @sale_balance.created_at = params[:sale_balance_invoice_date]
    @sale_balance.shipping_date = params[:sale_balance_shipping_date]


    ## detail barang
    loop = params[:count].nil? ? 0 : params[:count].to_i
    loop = 0 if params[:count].to_i < 0
    0.upto(loop) do |i|
      detail = AccountingSaleBalanceDetail.new
      if params["accounting_sale_balance_detail_product_id_#{i}"] != nil
        detail.product_name =  params["accounting_sale_balance_detail_product_name_#{i}"]
        detail.qty = params["accounting_sale_balance_detail_qty_#{i}"]
        detail.price = params["accounting_sale_balance_detail_price_#{i}"]
        detail.subtotal = params["accounting_sale_balance_detail_subtotal_#{i}"]
        detail.item_id = params["accounting_sale_balance_detail_product_id_#{i}"].to_s
        @sale_balance.accounting_sale_balance_details << detail

INSERT INTO `trans_items` (`updated_at`, `generated_by`, `item_id`, `price`, `generated_time`, `qty`, `purchase_sale_id`, `product_id`, `sequence`, `status`, `date_buy`, `user_id`, `is_addition`, `description`, `created_at`) VALUES('2012-03-29 04:16:24', NULL, 2, 1500.0, NULL, -1.0, 10, NULL, NULL, 2, NULL, 1, 0, 'Penjualan', '2012-03-29 04:16:24')
SELECT * FROM `trans_item_statuses` WHERE (`trans_item_statuses`.`name` = 'customer name esi 2') LIMIT 1
SELECT * FROM `items` WHERE (`items`.`id` = 2)
SELECT * FROM `item_details` WHERE (`item_details`.item_id = 2 AND (item_id = '2' AND qty != 0)) ORDER BY sequence ASC LIMIT 1
SELECT sum(`item_details`.total) AS sum_total FROM `item_details` WHERE (item_id = 2 AND qty != 0)
---

    respond_to do |format|
      if @sale_balance.save
        status = TransItemStatus.find_or_create_by_name(params[:customer][:code])
        0.upto(loop) do |i|
          if params[:sale_balance][:sent]=="true"
            item = Item.find(params["accounting_sale_balance_detail_product_id_#{i}"])
            item_details = item.item_details.find(:all, :conditions => ["item_id = '#{item.id}' AND qty != 0"], :order => "sequence ASC")

UPDATE `item_details` SET `qty` = 2, `updated_at` = '2012-03-29 03:58:19', `total` = 3000.0 WHERE `id` = 15
UPDATE `items` SET `stock` = 4.0, `total_value` = 6000.0, `updated_at` = '2012-03-29 05:44:42' WHERE `id` = 2
---
              qty -= item_detail.qty
              TransItem.create(:user_id => current_user.id, :item_id => params["accounting_sale_balance_detail_product_id_#{i}"], :is_addition => false,
                :price => item_detail.price,:qty => (item_detail.qty - tmp), :status => status.id,:purchase_sale_id => @sale_balance.id, :description => "Penjualan" )
              item_detail.update_attributes(:qty => tmp, :total => (tmp * item_detail.price.to_f) )

SELECT * FROM `accounting_sale_balances` WHERE (`accounting_sale_balances`.`id` = 4)
DELETE FROM `accounting_sale_balances` WHERE `id` = 4
---
  def destroy
    @sale_balance = AccountingSaleBalance.find(params[:id])
    $selected_month , $selected_year = @sale_balance.invoice_date.strftime("%m") , @sale_balance.invoice_date.strftime("%Y")
    if @sale_balance.destroy

SELECT * FROM `customers` WHERE (name LIKE '%d%' )
---
  def auto_complete_for_customer_code
    search = params[:customer][:code]
    @customers = Customer.find(:all, :conditions => ["name LIKE ? ", "%#{search}%"])

SELECT * FROM `items` WHERE (name LIKE '%b%' AND stock > '0')
---
  def multi_auto_complete_for_accounting_sale_balance_detail_product_name
    search = params["accounting_sale_balance_detail_product_name_#{params[:index]}"]
    products = Item.find(:all, :conditions => ["name LIKE ? AND stock > '0'", "%#{search}%"])

SELECT * FROM `accounting_sale_balances` WHERE (`accounting_sale_balances`.`id` = 12)
---
  def payment_record
    render :update do |page|
      if params[:show]
        page.replace_html "payment-record-#{params[:id]}", :partial => "payment_record", :locals => {:sale => AccountingSaleBalance.find(params[:id]) }

SELECT * FROM `accounting_sale_balances`
---
  def transfer_all
    $selected_account, $piutang  = [],[]
    if params[:id]
      @receivables = Receivable.all
    else
      @sale_balances = AccountingSaleBalance.all

SELECT * FROM `accounting_sale_debit_credits` WHERE (account_type = 'cash' or account_type = 'shipping' AND debit = '1')
SELECT * FROM `accounting_sale_balances` WHERE (`accounting_sale_balances`.`id` = 3)
---
  def save_transfer_all
    accounts =   AccountingSaleDebitCredit.find(:all, :conditions => ["account_type = 'cash' or  account_type = 'shipping' AND debit = '1'"])
    $selected_account.each do |sale|
      accounts.each  {
        |account| transfer = AccountingSaleBalance.find(sale).values.find_by_sale_debit_credit_id(account.id)
        account_id = ''
        debitcredit = account.account_type == "cash" ? AccountingSaleDebitCredit.find(params[:account][:sale_debit_credit_id]) : AccountingSaleDebitCredit.find(:first, :conditions => ["account_type = 'shipping_bank' AND account_id ='#{ AccountingSaleDebitCredit.find(params[:account][:sale_debit_credit_id]).account_id}' "])