app/controllers/items_controller.rb

SELECT * FROM `items` WHERE (completed ='1') ORDER BY name LIMIT 0, 20
---
  def index
    @sort = params[:sort]
    conditions = []
    #    conditions << "items.active='1'"
    conditions << "completed ='#{ params[:completed].nil? ? 1 : 0}'"
    conditions << "name LIKE '%#{params[:search]}%'" if params[:search].nil? == false || params[:search] == ""
    conditions = conditions.join(" AND ")
    @completed =  params[:completed].nil? ? 1 : 0
    @items = Item.paginate :page => params[:page], :conditions => conditions, :include => [:type, :unit], :order => @sort

SELECT * FROM `items` WHERE (`items`.`id` = 1)
SELECT * FROM `item_histories` WHERE (MONTH(last_date) = 02 AND YEAR(last_date) = 2012 AND item_id = '1' ) LIMIT 1
SELECT * FROM `trans_items` WHERE (MONTH(created_at) = 03 AND YEAR(created_at) = 2012 AND item_id = '1' ) ORDER BY item_id, created_at asc
---
  def show
    @title = "DAFTAR KELUAR MASUK BARANG"
    @periode = true
    @item = Item.find(params[:id])

    @items_trans = []
    if request.get? && params[:date]
      $month, $year = params[:date][:month], params[:date][:year]
    elsif request.get? && $selected_month && $selected_year
      $month, $year = $selected_month, $selected_year,
        $selected_month, $selected_year = nil, nil
    elsif request.get? && params[:format].nil? && $selected_month.nil? && $selected_year.nil?
      $month, $year = current_month, current_year
    end

    date = params[:date] ? params[:date] :  {:month => current_month , :year => current_year}
    date = params[:date] ? Time.mktime(params[:date][:year], params[:date][:month], 1, 0, 0, 0, 0) : Time.now
    previous_date = {:month => previous_current_month(date).strftime("%m"), :year => previous_current_month(date).strftime("%Y")}
    @history_item = ItemHistory.find(:first, :conditions => ["MONTH(last_date) = #{previous_date[:month]} AND YEAR(last_date) = #{previous_date[:year]} AND item_id = '#{@item.id}' "])
    @items_trans = TransItem.find(:all, :conditions => ["MONTH(created_at) = #{$month} AND YEAR(created_at) = #{$year} AND item_id = '#{@item.id}' "], :order => "item_id, created_at asc")

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO `items` (`description`, `created_at`, `unit_id`, `total_value`, `item_code`, `code_pcs`, `name`, `stock`, `updated_at`, `completed`, `price`, `inventory_method`, `type_id`, `alias`, `prototype_item_id`, `active`) VALUES('stock harga awal mouse', '2012-03-09 04:24:49', 2, 50000.0, 'M01', NULL, 'Mouse', 10.0, '2012-03-09 04:24:49', 1, 5000.0, 'FIFO', 3, '', NULL, 1)
INSERT INTO `item_histories` (`created_at`, `last_date`, `updated_at`, `last_stock`, `item_id`, `value`) VALUES('2012-03-09 04:24:49', '2012-02-06 00:00:00', '2012-03-09 04:24:49', 10, 6, 50000.0)
---
  def create
    @item = Item.new(params[:item])
    @item.active = params[:active].nil? ? false : true
    respond_to do |format|
      if @item.save
        $month, $year = current_month, current_year
        date = params[:date] ? Time.mktime(current_year, current_month, 1, 0, 0, 0, 0) : Time.now
        previous_date = {:month => previous_current_month(date).strftime("%m"), :year => previous_current_month(date).strftime("%Y")}
        ItemHistory.create(:item_id => @item.id, :last_date => Time.mktime(previous_date[:year], previous_date[:month], 6, 0, 0, 0, 0), :last_stock => @item.stock,:value =>  @item.total_value)

SELECT * FROM `items` WHERE (`items`.`id` = 2)
UPDATE `items` SET `updated_at` = '2012-03-29 02:38:47', `description` = 'Items Barang' WHERE `id` = 5
---
  def update
    @item = Item.find(params[:id])
    @item.active = params[:active].nil? ? false : true
    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT * FROM `types` WHERE (name LIKE '%a%')
---
  def auto_complete_for_type_name
    search = params[:type][:name]
    @types = Type.find(:all, :conditions => ["name LIKE ?", "%#{search}%"])

SELECT * FROM `units` WHERE (name LIKE '%s%' )
---
  def auto_complete_for_unit_name
    search = params[:unit][:name]
    @units = Unit.find(:all, :conditions => ["name LIKE ? ", "%#{search}%"])

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def show_item_details
    item = Item.find(params[:id])

SELECT * FROM `accounting_purchase_balances` WHERE (MONTH(invoice_date) = 03 AND YEAR(invoice_date) = 2012) ORDER BY created_at
SELECT * FROM `accounting_sale_balances` WHERE (MONTH(invoice_date) = 03 AND YEAR(invoice_date) = 2012) ORDER BY created_at
SELECT * FROM `accounting_purchase_balance_details` WHERE (`accounting_purchase_balance_details`.purchase_balance_id = 1)
SELECT * FROM `items` WHERE (`items`.`id` = 2)
SELECT * FROM `accounting_sale_balance_details` WHERE (`accounting_sale_balance_details`.sale_balance_id = 24)
SELECT * FROM `trans_items` WHERE (MONTH(created_at) = 03 AND YEAR(created_at) = 2012 AND is_addition = false AND purchase_sale_id is NULL)
SELECT * FROM `products` WHERE (MONTH(created_at) = 03 AND YEAR(created_at) = 2012)
---
  def history
    @title = "DAFTAR PEMBELIAN PENJUALAN BARANG"
    @periode = true
    item_id, conditions, @data = [],[],{}
    if request.post? && params[:date]
      $month, $year = params[:date][:month], params[:date][:year]
    elsif request.post? && $selected_month && $selected_year
      $month, $year = $selected_month, $selected_year,
        $selected_month, $selected_year = nil, nil
    elsif request.post? && params[:format].nil? && $selected_month.nil? && $selected_year.nil?
      $month, $year = current_month, current_year
    end
    conditions << "MONTH(invoice_date) = #{$month}"
    conditions << "YEAR(invoice_date) = #{$year}"
    conditions = conditions.join(" AND ")
    purchases = AccountingPurchaseBalance.find(:all ,:conditions => conditions, :order => 'created_at')
    sales = AccountingSaleBalance.find(:all ,:conditions => conditions, :order => 'created_at')
    purchases.each { |purchase| item_id << purchase.accounting_purchase_balance_details.collect { |e|   e.item_id }  }
    sales.each { |sale| item_id << sale.accounting_sale_balance_details.collect { |e| e.item_id  }  }
    #    uncompleted_items = Item.find(:all,:conditions => ["MONTH(created_at) = #{$month} AND YEAR(created_at) = #{$year} AND completed = 0 "])
    #    uncompleted_items.each { |uncompleted_item| item_id << uncompleted_item.trans_items.collect { |e | e.item_id}  }
    taking_items = TransItem.find(:all, :conditions => ["MONTH(created_at) = #{$month} AND YEAR(created_at) = #{$year} AND is_addition = false AND purchase_sale_id is NULL"] )
    commodities = Product.find(:all, :conditions => ["MONTH(created_at) = #{$month} AND YEAR(created_at) = #{$year}"])

SELECT * FROM `item_histories` WHERE (MONTH(last_date) = 02 AND YEAR(last_date) = 2012 AND item_id in (2) ) LIMIT 0, 30
---
      date = params[:date] ? params[:date] :  {:month => current_month , :year => current_year}
      date = params[:date] ? Time.mktime(params[:date][:year], params[:date][:month], 1, 0, 0, 0, 0) : Time.now
      previous_date = {:month => previous_current_month(date).strftime("%m"), :year => previous_current_month(date).strftime("%Y")}
      @history_items = ItemHistory.paginate :page => params[:page], :conditions => ["MONTH(last_date) = #{previous_date[:month]} AND YEAR(last_date) = #{previous_date[:year]} AND item_id in (#{item_id}) "]

SELECT * FROM `item_details` WHERE (`item_details`.`id` = 8)
---
  def edit_detail
    @item_detail = ItemDetail.find(params[:id])

SELECT * FROM `item_details` WHERE (`item_details`.`id` = 4)
SELECT sum(`item_details`.total) AS sum_total FROM `item_details` WHERE (item_id = 1 AND qty != 0)
UPDATE `item_details` SET `total` = 0.0, `updated_at` = '2012-03-28 04:48:24', `price` = 900.0 WHERE `id` = 4
UPDATE `items` SET `total_value` = 15000.0, `updated_at` = '2012-03-28 09:04:30', `stock` = 10.0 WHERE `id` = 2
---
  def update_detail
    @item_detail = ItemDetail.find(params[:id])
    @item_detail.total = @item_detail.qty.to_i * params[:item_detail][:price].to_f
    respond_to do |format|
      if @item_detail.update_attributes(params[:item_detail])