app/controllers/products_controller.rb

  def index

    @sort = params[:sort]
    conditions = []
    conditions << "items.active='1'"
    conditions << "completed='0'"
    conditions << "name LIKE '%#{params[:search]}%'" if params[:search].nil? == false || params[:search] == ""
    conditions = conditions.join(" AND ")
    @items = Item.paginate :page => params[:page], :conditions => conditions, :include => [:type, :unit], :order => @sort
---
SELECT * FROM `items` WHERE (items.active='1' AND completed='0') LIMIT 0, 20

  def new
    @product = Product.new
    @prototype_item = PrototypeItem.find_by_item_id(params[:item])
    @index = @prototype_item.prototype_item_details.size
---
SELECT * FROM `prototype_items` WHERE (`prototype_items`.`item_id` = '3') LIMIT 1
SELECT * FROM `prototype_item_details` WHERE (`prototype_item_details`.prototype_item_id = 1)
SELECT count(*) AS count_all FROM `prototype_item_details` WHERE (`prototype_item_details`.prototype_item_id = 1)

  def edit
    @product = Product.find(params[:id])
    @prototype_item = PrototypeItem.find_by_item_id(@product.item_id)
    @index = @prototype_item.prototype_item_details.size
---
SELECT * FROM `products` WHERE (`products`.`id` = 5)
SELECT * FROM `prototype_items` WHERE (`prototype_items`.`item_id` = 3) LIMIT 1
SELECT * FROM `prototype_item_details` WHERE (`prototype_item_details`.prototype_item_id = 1)
SELECT count(*) AS count_all FROM `prototype_item_details` WHERE (`prototype_item_details`.prototype_item_id = 1)

  def show_product_details
    conditions = []
    conditions << "item_id = #{params[:id]}"
    conditions << "status = 'false'"
    conditions = conditions.join(" AND ")
    product = Product.find(:all, :conditions => conditions , :order => 'created_at')
---
SELECT * FROM `products` WHERE (item_id = 3 AND status = 'false') ORDER BY created_at

  def input_price
    #    p params[:id]
    item = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 5)