app/controllers/trans_items_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 2)
SELECT * FROM `trans_items` WHERE (month(trans_items.created_at) = 03 and year(trans_items.created_at)= 2012 and status = 'pegambilan')
SELECT sum(`trans_items`.qty) AS sum_qty FROM `trans_items` WHERE (MONTH(created_at) = 03 AND YEAR(created_at) = 2012 AND is_addition = 1) AND (`trans_items`.item_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    if request.post? && params[:date]
      $month, $year = params[:date][:month], params[:date][:year]
      $stat = params[:status][:items]
    elsif request.get? && $selected_month && $selected_year
      $month, $year = $selected_month, $selected_year,
        $selected_month, $selected_year = nil, nil
    elsif request.get? && params[:format].nil? && $selected_month.nil? && $selected_year.nil?
      $month, $year = current_month, current_year
      $stat = nil
    end

    @date = params[:date] ? params[:date] :  {:month => current_month , :year => current_year}

    report = params[:report] == "request"? 'index_request.rpdf' : 'index_stock.rpdf'
    filename = params[:report] == "request"? "Purchase_request_#{selected_month.downcase}_#{selected_year.downcase}.pdf" : "Penerimaan Dan Pengeluaran Barang Bulan #{selected_month.downcase} #{selected_year.downcase}"
    conditions = []
    conditions << "MONTH(created_at) = #{$month}"
    conditions << "YEAR(created_at) = #{$year}"
    conditions << "status = '#{$stat}'" if $stat != nil && $stat != ""
    conditions = conditions.join(" AND ")

    date = params[:date] ? params[:date] :  {:month => current_month , :year => current_year}
    date = params[:date] ? Time.mktime(params[:date][:year], params[:date][:month], 1, 0, 0, 0, 0) : Time.now
    previous_date = {:month => previous_current_month(date).strftime("%m"), :year => previous_current_month(date).strftime("%Y")}
    @trans_items = TransItem.find(:all, :conditions => conditions, :order => "item_id, created_at desc")
    @purchase_requests = TransItem.find(:all, :conditions => conditions.to_s+" AND status = 'request'")
    @items = Item.find(:all,:limit => 10)
    @group = TransItem.find(:all, :conditions => "month(trans_items.created_at) = #{$month} and year(trans_items.created_at)= #{$year} and status = 'pegambilan'",:include => :user) # , :group => 'role_id'

SELECT * FROM `items` WHERE (`items`.`id` = '1') LIMIT 1
---
  def new
    @trans_item = TransItem.new
    @item = Item.find_by_id(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 2)
SELECT * FROM `trans_items` WHERE (`trans_items`.`id` = 21)
---
  def edit
    @trans_item = TransItem.find(params[:id])

INSERT INTO `trans_items` (`user_id`, `product_id`, `created_at`, `generated_time`, `updated_at`, `qty`, `is_addition`, `item_id`, `generated_by`, `sequence`, `date_buy`, `purchase_sale_id`, `status`, `description`, `price`) VALUES(1, NULL, '2012-03-30 03:23:07', NULL, '2012-03-30 03:23:07', 5.0, 1, 5, NULL, NULL, NULL, NULL, 8, 'penambahan', 0.0)
SELECT * FROM `trans_item_statuses` WHERE (`trans_item_statuses`.`name` = 'penambahan') LIMIT 1
SELECT * FROM `items` WHERE (`items`.`id` = 2)
INSERT INTO `item_details` (`total`, `is_deleted`, `qty`, `price`, `created_at`, `sequence`, `purchase_balance_id`, `item_id`, `purchasing_date`, `updated_at`) VALUES(7500.0, NULL, 5, 1500.0, '2012-03-28 05:30:16', 1, NULL, 2, '2012-03-28 12:30:16', '2012-03-28 05:30:16')
UPDATE `item_details` SET `qty` = 2, `updated_at` = '2012-03-29 03:13:53', `total` = 3000.0 WHERE `id` = 15
UPDATE `items` SET `total_value` = 7500.0, `updated_at` = '2012-03-28 05:30:16', `stock` = 180.0 WHERE `id` = 2
---
  def create
    status = TransItemStatus.find_or_create_by_name(params[:trans_item][:status_name]) unless params[:trans_item][:status_name].blank?
    @trans_item = TransItem.new(params[:trans_item])
    @trans_item.user_id = current_user.id
    @trans_item.trans_item_status = status
    if params[:trans_item_type]=="Pengambilan"
      @trans_item.is_addition = false
      Item.taking_item(params[:trans_item])
    elsif params[:trans_item_type]=="Penambahan"
      @trans_item.is_addition = true
      item = Item.find(params[:trans_item][:item_id])
      item.item_details << ItemDetail.new(
        :qty => params[:trans_item][:qty],
        :price => item.price,
        :total => params[:trans_item][:qty].to_i * item.price,
        :purchasing_date => Time.now
      )
      item.update_attributes(
        :stock => item.stock.to_i + params[:trans_item][:qty].to_i,
        :total_value => ItemDetail.get_total_value_from_item(item.id)
      )

SELECT * FROM `trans_items` WHERE (`trans_items`.`id` = 26)
DELETE FROM `trans_items` WHERE `id` = 26
---
  def destroy_item
    @trans_item = TransItem.find(params[:id])
    @trans_item.destroy

SELECT * FROM `trans_item_statuses` WHERE (name LIKE '%1%')
---
  def auto_complete_for_trans_item_status_name
    search = params[:trans_item][:status_name]
    @statuses = TransItemStatus.find(:all, :conditions => ["name LIKE ?", "%#{search}%"])