app/controllers/units_controller.rb

SELECT * FROM `units`
---
  def index
    @units = Unit.all

SELECT * FROM `units` WHERE (`units`.`id` = 2)
---
  def edit
    @unit = Unit.find(params[:id])